# Total population supplied by water supply industry

# Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os
import warnings

# Options and Settings

In [2]:
%matplotlib inline
plt.style.use('ggplot')
plt.rcParams['figure.autolayout'] = True
plt.rcParams['font.size'] = 12
path = os.getcwd()                                         # get current working directory
warnings.simplefilter('ignore')

# Import Data

In [3]:
filepath = os.path.join('datasets', 'Total population supplied by water supply industry.csv')

df = pd.read_csv(filepath)

# Head and Tail

In [4]:
df = df[:880]                                   # select index position 0-879
df

    Country or Area  Year  Value Value Footnotes Unit
0           Albania  2015   82.0             NaN    %
1           Albania  2014   81.0             NaN    %
2           Algeria  2015   98.0             NaN    %
3           Algeria  2014   98.0             NaN    %
4           Algeria  2013   98.0             NaN    %
..              ...   ...    ...             ...  ...
875           Yemen  2003   15.9              20    %
876           Yemen  2002   14.8              20    %
877           Yemen  2001   14.4              20    %
878           Yemen  2000   14.3              20    %
879           Yemen  1999   14.0              20    %

[880 rows x 5 columns]

In [5]:
df.shape

(880, 5)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 880 entries, 0 to 879
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  880 non-null    object
 1   Year             880 non-null    object
 2   Value            880 non-null    float64
 3   Value Footnotes  151 non-null    object
 4   Unit             880 non-null    object
dtypes: float64(1), object(4)
memory usage: 34.5+ KB

In [7]:
df.rename(columns=
    {
        'Country or Area': 'Country_or_Area', 
        'Value': 'PctSupplied'
    }, 
    inplace=True
)

df.head()

  Country_or_Area  Year  PctSupplied Value Footnotes Unit
0         Albania  2015         82.0             NaN    %
1         Albania  2014         81.0             NaN    %
2         Algeria  2015         98.0             NaN    %
3         Algeria  2014         98.0             NaN    %
4         Algeria  2013         98.0             NaN    %

In [8]:
df1 = df[['Country_or_Area', 'Year', 'PctSupplied', 'Unit']]

df1

    Country_or_Area  Year  PctSupplied Unit
0           Albania  2015         82.0    %
1           Albania  2014         81.0    %
2           Algeria  2015         98.0    %
3           Algeria  2014         98.0    %
4           Algeria  2013         98.0    %
..              ...   ...          ...  ...
875           Yemen  2003         15.9    %
876           Yemen  2002         14.8    %
877           Yemen  2001         14.4    %
878           Yemen  2000         14.3    %
879           Yemen  1999         14.0    %

[880 rows x 4 columns]

In [9]:
df1['PctSupplied'] = df1['PctSupplied'].apply(lambda x: np.round(x, 2))      # round percentage supplied to 2 dp
df1['PctSupplied']

0      82.0
1      81.0
2      98.0
3      98.0
4      98.0
       ...
875    15.9
876    14.8
877    14.4
878    14.3
879    14.0
Name: PctSupplied, Length: 880, dtype: float64

In [10]:
df1.describe(include='object')

       Country_or_Area  Year Unit
count              880   880  880
unique              93    24    1
top          Singapore  2012    %
freq                22    60  880

In [11]:
df1['Country_or_Area'].value_counts()

Singapore                                         22
Andorra                                           22
Tunisia                                           22
Monaco                                            22
China, Hong Kong Special Administrative Region    19
                                                  ..
Switzerland                                        1
Nigeria                                            1
Croatia                                            1
Central African Republic                           1
Guadeloupe                                         1
Name: Country_or_Area, Length: 93, dtype: int64

In [12]:
df1['Year'].value_counts()

2012    60
2011    56
2005    56
2010    55
2008    55
2007    54
2004    53
2009    52
2013    51
2006    51
2002    50
2001    46
2003    44
2000    43
2014    43
2015    39
1990    18
1995    17
1999    13
1998     8
1996     8
1997     6
1991     1
2016     1
Name: Year, dtype: int64

In [13]:
df1['PctSupplied'].value_counts()

100.00    164
99.90      40
95.00      22
99.00      19
31.00      14
         ...
72.67       1
71.82       1
69.38       1
71.75       1
14.00       1
Name: PctSupplied, Length: 369, dtype: int64

# Missing Values Exploration

In [14]:
df1.isna().sum()

Country_or_Area    0
Year               0
PctSupplied        0
Unit               0
dtype: int64

# Grouping and Aggregation

In [15]:
country_area_grouped = df1.groupby('Country_or_Area')
country_area_grouped.head()

    Country_or_Area  Year  PctSupplied Unit
0           Albania  2015         82.0    %
1           Albania  2014         81.0    %
2           Algeria  2015         98.0    %
3           Algeria  2014         98.0    %
4           Algeria  2013         98.0    %
..              ...   ...          ...  ...
865           Yemen  2013         18.6    %
866           Yemen  2012         18.5    %
867           Yemen  2011         18.6    %
868           Yemen  2010         18.6    %
869           Yemen  2009         18.2    %

[380 rows x 4 columns]

In [16]:
country_area_grouped.get_group('France')

    Country_or_Area  Year  PctSupplied Unit
301          France  2013         99.0    %
302          France  2012         99.0    %
303          France  2011         99.0    %
304          France  2010         99.0    %
305          France  2008         99.0    %
306          France  2001         99.4    %

In [17]:
country_area_grouped.get_group('Germany')

    Country_or_Area  Year  PctSupplied Unit
322         Germany  2013        99.33    %
323         Germany  2012        99.32    %
324         Germany  2011        99.31    %
325         Germany  2010        99.30    %
326         Germany  2007        99.20    %
327         Germany  2004        99.20    %
328         Germany  2001        99.10    %